parejas.org
#+title: Emparejamientos

* Definicion
En una gr치fica \(G\), un *emparejamiento* es una coleccion de aristas ajenas.
Decimos que el emparejamiento \(M\) es *perfecto* si todo
vertice de \(G\) est치 en alguna arista de \(M\).

Sea \(G=(A,B)\) una gr치fica bipartita. Dado \(S\subseteq A\),
denotamos con \(N(S)\) al conjunto \(\{y\in B\mid\text{ existe }x\in
A\text{ con }y\sim x\}\)

* Teorema de Hall

Sea \(G=(A,B)\) una gr치fica bipartita con \(|A|=|B|\). Entonces existe
un emparejamiento perfecto en \(G\) si y solo si para todo
\(S\subseteq A\) se tiene que \(|N(s)|\geq |S|\) 

